#### Terraform Workspace 🛠️`sausage`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/stackhpc/bastion-sausage/runs/run-1F9Wj6SVHVJFYmUu

Waiting for the plan to start...

Terraform v1.0.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
openstack_compute_keypair_v2.bastion: Refreshing state... [id=sausage-bastion]
openstack_networking_secgroup_v2.bastion: Refreshing state... [id=7aa19293-b636-4b1f-846b-531446337c92]
openstack_networking_secgroup_rule_v2.mosh: Refreshing state... [id=d7671bb6-d98d-4efb-a660-b7e76a1b6d2a]
openstack_networking_secgroup_rule_v2.ssh: Refreshing state... [id=34dbb269-ffc2-42ae-b427-90b47eb1e060]
openstack_networking_secgroup_rule_v2.icmp: Refreshing state... [id=25d1c37f-1715-47d1-a6b7-fab19424f038]
openstack_networking_port_v2.bastion: Refreshing state... [id=89c8f25f-3bea-4900-9506-b23b60622543]
openstack_networking_floatingip_associate_v2.bastion: Refreshing state... [id=86d01752-9767-4d60-9e0f-806b43322144]
openstack_compute_instance_v2.bastion: Refreshing state... [id=ad184c91-7db6-4db5-b503-9bb81079caee]
null_resource.unattended-upgrades: Refreshing state... [id=7997623724640190265]
null_resource.users["bartosz"]: Refreshing state... [id=5482831289532090562]
null_resource.sudoers["bharat"]: Refreshing state... [id=4758261040548662879]
null_resource.users["will"]: Refreshing state... [id=4541674749546663798]
null_resource.users["steveb"]: Refreshing state... [id=926830677490972571]
null_resource.users["bharat"]: Refreshing state... [id=3005788667936463191]
null_resource.users["michal"]: Refreshing state... [id=557136424674485923]
null_resource.users["matt"]: Refreshing state... [id=7054035877974170974]
null_resource.users["pierre"]: Refreshing state... [id=3506786981165295107]
null_resource.host-key: Refreshing state... [id=2148257717153280471]
null_resource.users["isaac"]: Refreshing state... [id=3933815550887916823]
null_resource.users["mark"]: Refreshing state... [id=2115458144934064897]
null_resource.users["piotr"]: Refreshing state... [id=8302577004424375532]
null_resource.users["stig"]: Refreshing state... [id=6377224907173491117]
null_resource.mosh: Refreshing state... [id=6251265590710438686]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # openstack_networking_floatingip_associate_v2.bastion has been deleted
  - resource "openstack_networking_floatingip_associate_v2" "bastion" {
      - fixed_ip    = "10.0.3.99" -> null
      - floating_ip = "193.16.42.80" -> null
      - id          = "86d01752-9767-4d60-9e0f-806b43322144" -> null
      - port_id     = "89c8f25f-3bea-4900-9506-b23b60622543" -> null
      - region      = "Bunker" -> null
    }
  # openstack_networking_port_v2.bastion has been changed
  ~ resource "openstack_networking_port_v2" "bastion" {
      - device_id              = "ad184c91-7db6-4db5-b503-9bb81079caee" -> null
      - device_owner           = "compute:nova" -> null
      ~ dns_assignment         = [
          - {
              - "fqdn"       = "sausage-bastion.dns.sausage.cloud."
              - "hostname"   = "sausage-bastion"
              - "ip_address" = "10.0.3.99"
            },
          + {
              + "fqdn"       = "host-10-0-3-99.dns.sausage.cloud."
              + "hostname"   = "host-10-0-3-99"
              + "ip_address" = "10.0.3.99"
            },
        ]
      - dns_name               = "sausage-bastion" -> null
        id                     = "89c8f25f-3bea-4900-9506-b23b60622543"
        name                   = "sausage-bastion"
        tags                   = []
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # openstack_compute_keypair_v2.bastion has been deleted
  - resource "openstack_compute_keypair_v2" "bastion" {
      - fingerprint = "d9:c9:3a:f7:25:33:52:0a:3e:12:61:ad:ce:44:1e:14" -> null
      - id          = "sausage-bastion" -> null
      - name        = "sausage-bastion" -> null
      - public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDFG04bDnzPQwrzbnxFmezrFvzcQkbWTO7w578S51Q7gbHjyN77s9J3JAwNqvVfoKuGdf9YDnMbowhOdmmdWuWLb9qY88rdfb605bC0k6aQg42FZ9L4ucuVU7qhoHRso2Rxos658SvG2Eba+3gIypIRG1ySBjLw5NJDLTIrtMOkkuf7EmitkkQCb33Men3O2mjTcNkb4DLsw2mHkmkUNhflqrzFhNGZvqCUOBkRodqXR0zGdyX3FXrc6MjdvL1RvIlFOUwH6jnBNXDsTNwrS47rhXTq8cCeROs4QMdEpRJqKKXrY1d5Ph81MwRp9cUoJ1JnwgpcFyl8K3Q++UYAdDQL" -> null
      - region      = "Bunker" -> null
    }
  # openstack_compute_instance_v2.bastion has been deleted
  - resource "openstack_compute_instance_v2" "bastion" {
      - access_ip_v4        = "10.0.3.99" -> null
      - all_metadata        = {} -> null
      - all_tags            = [] -> null
      - availability_zone   = "nova" -> null
      - config_drive        = true -> null
      - flavor_id           = "f81a2c71-32ab-4f07-a9bf-f4bd5ed97023" -> null
      - flavor_name         = "bratwurst" -> null
      - force_delete        = false -> null
      - id                  = "ad184c91-7db6-4db5-b503-9bb81079caee" -> null
      - image_id            = "f4f37a32-3b37-4487-b87a-bd9f89f79c95" -> null
      - image_name          = "Ubuntu 20.04 (20200714)" -> null
      - key_pair            = "sausage-bastion" -> null
      - name                = "sausage-bastion" -> null
      - power_state         = "active" -> null
      - region              = "Bunker" -> null
      - security_groups     = [
          - "sausage-bastion",
        ] -> null
      - stop_before_destroy = false -> null
      - tags                = [] -> null

      - network {
          - access_network = false -> null
          - fixed_ip_v4    = "10.0.3.99" -> null
          - mac            = "fa:16:3e:32:fa:2f" -> null
          - name           = "stackhpc" -> null
          - port           = "89c8f25f-3bea-4900-9506-b23b60622543" -> null
          - uuid           = "4ca2399f-3040-4686-82fa-e99bd50d215a" -> null
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # null_resource.host-key must be replaced
-/+ resource "null_resource" "host-key" {
      ~ id       = "2148257717153280471" -> (known after apply)
      ~ triggers = {
          - "host"        = "193.16.42.80"
          - "host_keys"   = (sensitive)
          - "instance"    = "ad184c91-7db6-4db5-b503-9bb81079caee"
          - "private_key" = (sensitive)
          - "user"        = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.mosh must be replaced
-/+ resource "null_resource" "mosh" {
      ~ id       = "6251265590710438686" -> (known after apply)
      ~ triggers = {
          - "host"        = "193.16.42.80"
          - "instance"    = "ad184c91-7db6-4db5-b503-9bb81079caee"
          - "private_key" = (sensitive)
          - "user"        = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.sudoers["bharat"] must be replaced
-/+ resource "null_resource" "sudoers" {
      ~ id       = "4758261040548662879" -> (known after apply)
      ~ triggers = {
          - "host"        = "193.16.42.80"
          - "instance"    = "ad184c91-7db6-4db5-b503-9bb81079caee"
          - "private_key" = (sensitive)
          - "user"        = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.unattended-upgrades must be replaced
-/+ resource "null_resource" "unattended-upgrades" {
      ~ id       = "7997623724640190265" -> (known after apply)
      ~ triggers = {
          - "host"        = "193.16.42.80"
          - "instance"    = "ad184c91-7db6-4db5-b503-9bb81079caee"
          - "private_key" = (sensitive)
          - "user"        = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.users["bartosz"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "5482831289532090562" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIM1iGZ6wblHvuShGuP3yzhoa5ME069yYE2jPFEOAPttC bartosz@stackhpc.com
            EOT
          - "host"            = "193.16.42.80"
          - "instance"        = "ad184c91-7db6-4db5-b503-9bb81079caee"
          - "private_key"     = (sensitive)
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.users["bharat"] will be destroyed
  - resource "null_resource" "users" {
      - id       = "3005788667936463191" -> null
      - triggers = {
          - "authorized_keys" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIOzqpG9N2Zjnb45cYUgtm1R3PrTJZhB+cUcFbqoijzWn brtknr@MacBook
            EOT
          - "host"            = "193.16.42.80"
          - "instance"        = "ad184c91-7db6-4db5-b503-9bb81079caee"
          - "private_key"     = (sensitive)
          - "user"            = "ubuntu"
        } -> null
    }

  # null_resource.users["darmach"] will be created
  + resource "null_resource" "users" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # null_resource.users["isaac"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "3933815550887916823" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIM1y8M+f9AQll1yGTJspJBLMSXklT4ktzl4ccMOMf3iR isaac@stackhpc.com
            EOT
          - "host"            = "193.16.42.80"
          - "instance"        = "ad184c91-7db6-4db5-b503-9bb81079caee"
          - "private_key"     = (sensitive)
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.users["mark"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "2115458144934064897" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJXNGOmsnRcZdmjMA5f3fgq8l8+QMjBywJQzuvxlhslx mark@mark-xps15
            EOT
          - "host"            = "193.16.42.80"
          - "instance"        = "ad184c91-7db6-4db5-b503-9bb81079caee"
          - "private_key"     = (sensitive)
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.users["matt"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "7054035877974170974" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJa0D+EVJkKo6NDnw23+W23tkKr4MPZQxn0+guCXKCT1 matt@stackhpc.com
            EOT
          - "host"            = "193.16.42.80"
          - "instance"        = "ad184c91-7db6-4db5-b503-9bb81079caee"
          - "private_key"     = (sensitive)
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.users["michal"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "557136424674485923" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICY4CwVM472QS5TYhEwAHge4vbkuBtpVUCC8cyIolYR5 michal@stackhpc.com
            EOT
          - "host"            = "193.16.42.80"
          - "instance"        = "ad184c91-7db6-4db5-b503-9bb81079caee"
          - "private_key"     = (sensitive)
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.users["pierre"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "3506786981165295107" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIATVu5COwRn9FirPl2GhQIY/RmZkNGM+CcXOhT7WujBf priteau@raider.home
            EOT
          - "host"            = "193.16.42.80"
          - "instance"        = "ad184c91-7db6-4db5-b503-9bb81079caee"
          - "private_key"     = (sensitive)
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.users["piotr"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "8302577004424375532" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHK1Kf1hRYskYfYtXnqnyzD6vFbpKVyUtcxcn2pYL2y+ piotr@stackhpc.com
            EOT
          - "host"            = "193.16.42.80"
          - "instance"        = "ad184c91-7db6-4db5-b503-9bb81079caee"
          - "private_key"     = (sensitive)
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.users["steveb"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "926830677490972571" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDuNoaIV5Nw4HGblhFg6BOTpSlO+QZWxsZOtiaxR71CcP85+Sk8LQUY45L6gtO6n3swTLvkI96nTEQWjY7Cw2Z5WirO8Jctm0dYFtqU17jSkrgQymF7rHy/JCOVoIyLBlt/TJuTU5IRhw3Sd6HjAqvYstAV+8Bd1UWkzFQK/gUGx3SaqyWvKcINmSmszdS7+ZM/07Y9vXPW4MiJzWHQl1yqCEQ+QUttuYOxbNaHAwb9JOPgzsBnSFHW4skpCYKl4nsssE4um68Da7V0YFumwWXc/T6PBqwdMf2E2Ix/dFympzZGJA86mZFN6+NB2vvxKV7eY6BkKbbsinzQlCQT78AT steveb@DESKTOP-NSUK66K(base)
            EOT
          - "host"            = "193.16.42.80"
          - "instance"        = "ad184c91-7db6-4db5-b503-9bb81079caee"
          - "private_key"     = (sensitive)
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.users["stig"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "6377224907173491117" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHnj2Ie2DACWi25spQ5wr6dJEthiuUGyUQSOI88ehVZc stig@columba.local
            EOT
          - "host"            = "193.16.42.80"
          - "instance"        = "ad184c91-7db6-4db5-b503-9bb81079caee"
          - "private_key"     = (sensitive)
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.users["will"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "4541674749546663798" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCecNnBo+YV/P4QIgZtFbZVy5nPpz3w3agMfv8a2fGMNGo0DZkAIli2enl8fo7swyOF7Kic5gl7XXv3urURMaiLfWSmLdrAw9p5R6LXmTTo6JHYd/Go9KtA++6S5iY9z1UQrgJwKimxjNyC67KplKIWOy/en6FzJ1HboNKEsZtrFzSc/VSKeJRBMM/dHNH/fQKKGwXbwyVuPT/mY+DBC67VQKZgg/Z8Q/GvK5Ux6gI07ixQxC48O9JB440EW/MxCfUqbDJ3uqB2jsnp4CpcBPHiSQ1YW2yAwQMij8/18DhouiP7i/4WPy1Z4FeQddU1sSNsrd1xv5j/ErPuDkW9zzr+lnlxI8RdR0e8ZIR79P883De/EbD7x9NyJjBl/0ObDtDzHaIf7MFgkqU32czKRo82+0FYT4Mh/lRZ5KrMjjuMDMA24/OLHrqBHQM3dSHnTKjHQmzia9oJDSs35haE2lPldU8SCQvB8W+N6wpPoDQcR5YDGHn1ugw/WM1+yKle2TE= will@stackhpc.com
            EOT
          - "host"            = "193.16.42.80"
          - "instance"        = "ad184c91-7db6-4db5-b503-9bb81079caee"
          - "private_key"     = (sensitive)
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # openstack_compute_instance_v2.bastion will be created
  + resource "openstack_compute_instance_v2" "bastion" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + config_drive        = true
      + flavor_id           = "f81a2c71-32ab-4f07-a9bf-f4bd5ed97023"
      + flavor_name         = (known after apply)
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = "f4f37a32-3b37-4487-b87a-bd9f89f79c95"
      + image_name          = (known after apply)
      + key_pair            = (known after apply)
      + name                = "sausage-bastion"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = (known after apply)
      + stop_before_destroy = false

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = "89c8f25f-3bea-4900-9506-b23b60622543"
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_keypair_v2.bastion will be created
  + resource "openstack_compute_keypair_v2" "bastion" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "sausage-bastion"
      + private_key = (known after apply)
      + public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDFG04bDnzPQwrzbnxFmezrFvzcQkbWTO7w578S51Q7gbHjyN77s9J3JAwNqvVfoKuGdf9YDnMbowhOdmmdWuWLb9qY88rdfb605bC0k6aQg42FZ9L4ucuVU7qhoHRso2Rxos658SvG2Eba+3gIypIRG1ySBjLw5NJDLTIrtMOkkuf7EmitkkQCb33Men3O2mjTcNkb4DLsw2mHkmkUNhflqrzFhNGZvqCUOBkRodqXR0zGdyX3FXrc6MjdvL1RvIlFOUwH6jnBNXDsTNwrS47rhXTq8cCeROs4QMdEpRJqKKXrY1d5Ph81MwRp9cUoJ1JnwgpcFyl8K3Q++UYAdDQL"
      + region      = (known after apply)
    }

  # openstack_networking_floatingip_associate_v2.bastion will be created
  + resource "openstack_networking_floatingip_associate_v2" "bastion" {
      + fixed_ip    = (known after apply)
      + floating_ip = "193.16.42.80"
      + id          = (known after apply)
      + port_id     = "89c8f25f-3bea-4900-9506-b23b60622543"
      + region      = (known after apply)
    }

Plan: 18 to add, 0 to change, 15 to destroy.

Changes to Outputs:
  ~ users = [
      - "bharat",
      + "darmach",
        # (10 unchanged elements hidden)
    ]
```

</details>

#### Author ✍️@bbezak